<a href="https://colab.research.google.com/github/Ankitapaul1234/gc_ml/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

# **Seires from lists**

# Pandas on **series**

In [ ]:
country = ['India','USA','Japan','France']

pd.Series(country)

0     India
1       USA
2     Japan
3    France
dtype: object

In [ ]:
#integers
runs = [13,15,20,78,12]
pd.Series(runs)

0    13
1    15
2    20
3    78
4    12
dtype: int64

In [ ]:
#custom index
marks = [68,89,85,80]
sub = ['english','maths','science','bengali']

pd.Series(marks,index = sub)

english    68
maths      89
science    85
bengali    80
dtype: int64

In [ ]:
#add name

amarks = pd.Series(marks,index = sub,name = 'ankita r marks')
amarks

english    68
maths      89
science    85
bengali    80
Name: ankita r marks, dtype: int64

# **Series from dict**

In [ ]:
marks ={
    'maths' : 89,
    'eng' : 67,
    'ben': 80,
    'phy' :74
}

marks_series = pd.Series(marks,name = 'ankita r marks')
marks_series

maths    89
eng      67
ben      80
phy      74
Name: ankita r marks, dtype: int64

# **Series Attributes**

In [ ]:
#size
marks_series.size

4

In [ ]:
marks_series.dtype

dtype('int64')

In [ ]:
#name
marks_series.name

'ankita r marks'

In [ ]:
#is_unique

marks_series.is_unique

pd.Series([1,2,4,1]).is_unique

False

In [ ]:
#index
marks_series.index

Index(['maths', 'eng', 'ben', 'phy'], dtype='object')

In [ ]:
#values
type(marks_series.values)

numpy.ndarray

# **Series using read_csv**

In [ ]:
#with one col
subs = pd.read_csv('/content/bollywood.csv',squeeze=True)
subs
#df = pd.read_csv('/content/bollywood.csv')
#df_ser = df.squeeze("columns")  # This ensures it's a Series if there's only one column
#df_ser

TypeError: read_csv() got an unexpected keyword argument 'squeeze'

In [ ]:
import pandas as pd

# Read the CSV file into a DataFrame
df = pd.read_csv('/content/bollywood.csv')

# Convert to a Series if the DataFrame has only one column
subs = df.squeeze("columns")

print(type(subs))  # Will be a Series if only one column exists
print(subs)

<class 'pandas.core.frame.DataFrame'>
                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1495                Hum Tumhare Hain Sanam    Shah Rukh Khan
1496                   Aankhen (2002 film)  Amitabh Bachchan
1497                       Saathiya (film)      Vivek Oberoi
1498                        Company (film)        Ajay Devgn
1499                  Awara Paagal Deewana      Akshay Kumar

[1500 rows x 2 columns]